app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" WHERE (number like'12345')
---
	def index
	    @customers=Customer.all

INSERT INTO "customers" ("number", "cusname", "product", "location", "frequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 12345], ["cusname", "蔡侑恩"], ["product", "抹茶拿鐵"], ["location", "師大門市"], ["frequency", 20], ["created_at", "2015-12-30 13:43:29.410036"], ["updated_at", "2015-12-30 13:43:29.410036"]]
---
	def create
		@customer = Customer.new(customer_params)
		if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "customers" SET "number" = ?, "cusname" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["number", 102306089], ["cusname", "蔡侑恩"], ["updated_at", "2015-12-30 17:47:04.481427"], ["id", 2]]
---
    def update
        @customer=Customer.find(params[:id])
        if @customer.update(customer_params)