app/controllers/inventories_controller.rb

    def index
		@inventories=Inventory.all
---
SELECT "inventories".* FROM "inventories" WHERE (number like'1823') AND (location like'政大門市')

    def edit
    	@inventory=Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 1]]

    def show
	   @inventory=Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 2]]

	def create
		@inventory = Inventory.new(inventory_params)
		if @inventory.save
---
INSERT INTO "inventories" ("number", "location", "name", "sales", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 1374], ["location", "政大門市"], ["name", "冰拿鐵"], ["sales", 13], ["stock", 60], ["created_at", "2015-12-30 17:38:42.129635"], ["updated_at", "2015-12-30 17:38:42.129635"]]

    def update
        @inventory=Inventory.find(params[:id])
        if @inventory.update(inventory_params)
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "inventories" SET "number" = ?, "location" = ?, "name" = ?, "sales" = ?, "stock" = ?, "updated_at" = ? WHERE "inventories"."id" = ?  [["number", 14762], ["location", "政大門市"], ["name", "抹茶拿鐵"], ["sales", 280], ["stock", 10000], ["updated_at", "2015-12-28 16:41:06.214423"], ["id", 3]]