app/controllers/marketings_controller.rb

SELECT "marketings".* FROM "marketings" WHERE (number like'1246')
---
	def index
	    @marketings=Marketing.all

SELECT  "marketings".* FROM "marketings" WHERE "marketings"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
    	@marketing=Marketing.find(params[:id])

SELECT  "marketings".* FROM "marketings" WHERE "marketings"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
	   @marketing=Marketing.find(params[:id])

INSERT INTO "marketings" ("number", "name", "time", "sales", "suggestion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 19373], ["name", "抹茶拿鐵"], ["time", 199712], ["sales", 1872], ["suggestion", "重點推廣（買一送一）"], ["created_at", "2015-12-28 11:01:12.201506"], ["updated_at", "2015-12-28 11:01:12.201506"]]
---
	def create
		@marketing = Marketing.new(marketing_params)
		if @marketing.save

SELECT  "marketings".* FROM "marketings" WHERE "marketings"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "marketings" SET "number" = ?, "name" = ?, "time" = ?, "sales" = ?, "suggestion" = ?, "updated_at" = ? WHERE "marketings"."id" = ?  [["number", 12384], ["name", "抹茶可可碎片"], ["time", 201506], ["sales", 500], ["suggestion", "多安排買一送一"], ["updated_at", "2015-12-30 11:50:24.353028"], ["id", 5]]
---
    def update
        @marketing=Marketing.find(params[:id])
        if @marketing.update(marketing_params)